---
kind: type
id: T:Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIDataItem
source: html/c1471c51-00e6-067b-164a-d00f4d66f97e.htm
---
# Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIDataItem

The input and output data used by external UI servers for initializing and storing the UI settings.

## Syntax (C#)
```csharp
public class PipeFittingAndAccessoryPressureDropUIDataItem : IDisposable
```

## Remarks
One family instance has one UI data item.
 The UI data item contains a corresponding PipeFittingAndAccessoryData which is used for initialing the UI settings and an entity which is used for storing the UI settings.